In [100]:
import pandas as pd

In [102]:
data= pd.read_csv("MakeSenseOfCensus.csv")

In [103]:
data

,age,educationnum,race,sex,capitalgain,capitalloss,hoursperweek,income
0,39,13,4,1,2174,0,40,0
1,50,13,4,1,0,0,13,0
2,38,9,4,1,0,0,40,0
3,53,7,2,1,0,0,40,0
4,28,13,2,0,0,0,40,0
...,...,...,...,...,...,...,...,...
995,56,9,4,1,0,0,55,1
996,45,14,4,1,0,0,45,0
997,48,13,4,1,0,0,58,1
998,40,10,4,1,2580,0,40,0
999,39,13,4,1,15024,0,50,1

In [6]:
data.income.dtype

dtype('int64')

In [12]:
data.income.astype("float")

0      0.0
1      0.0
2      0.0
3      0.0
4      0.0
      ...
995    1.0
996    0.0
997    1.0
998    0.0
999    1.0
Name: income, Length: 1000, dtype: float64

In [10]:
data.income.dtype

dtype('int64')

In [13]:
data.age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Name: age, Length: 1000, dtype: bool

In [14]:
data.isnull()

,age,education-num,race,sex,capital-gain,capital-loss,hours-per-week,income
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
995,False,False,False,False,False,False,False,False
996,False,False,False,False,False,False,False,False
997,False,False,False,False,False,False,False,False
998,False,False,False,False,False,False,False,False
999,False,False,False,False,False,False,False,False

In [16]:
data.isna().sum()

age               0
education-num     0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
income            0
dtype: int64

In [21]:
df=pd.DataFrame({"a":[12,34,56]})
df

    a
0  12
1  34
2  56

In [22]:
data.isna().sum()

age               0
education-num     0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
income            0
dtype: int64

In [23]:
data.dtypes

age               int64
education-num     int64
race              int64
sex               int64
capital-gain      int64
capital-loss      int64
hours-per-week    int64
income            int64
dtype: object

In [24]:
data[pd.isnull(data.age)]

Empty DataFrame
Columns: [age, education-num, race, sex, capital-gain, capital-loss, hours-per-week, income]
Index: []

In [45]:
data.sex.replace(0,1)

0      1
1      1
2      1
3      1
4      1
      ..
995    1
996    1
997    1
998    1
999    1
Name: sex, Length: 1000, dtype: int64

In [46]:
data.sex

0      1
1      1
2      1
3      1
4      1
      ..
995    1
996    1
997    1
998    1
999    1
Name: sex, Length: 1000, dtype: int64

In [47]:
data=data.rename(columns={"sex":"Gender"})

In [52]:
data=data.rename(columns={"Gender":"sex"})

In [55]:
data=data.rename(columns={"sex":"Gender"})

In [58]:
data.Gender.replace(1,0)

0      0
1      0
2      0
3      0
4      0
      ..
995    0
996    0
997    0
998    0
999    0
Name: Gender, Length: 1000, dtype: int64

In [60]:
data.Gender.rename(index={0:"entryfirst",1:"secondentry"})

entryfirst     1
secondentry    1
2              1
3              1
4              1
              ..
995            1
996            1
997            1
998            1
999            1
Name: Gender, Length: 1000, dtype: int64

In [61]:
data.Gender

0      1
1      1
2      1
3      1
4      1
      ..
995    1
996    1
997    1
998    1
999    1
Name: Gender, Length: 1000, dtype: int64

In [63]:
data.set_index("ID")

KeyError: "None of ['ID'] are in the columns"

In [65]:
s1=pd.Series(["a","b"])
s2=pd.Series(["c","d"])
pd.concat([s1,s2])

0    a
1    b
0    c
1    d
dtype: object

In [67]:
pd.concat([s1,s2],ignore_index=True)

0    a
1    b
2    c
3    d
dtype: object

In [105]:
df1=pd.DataFrame([['a',1],['b',2]], columns=['letter','number'])
df2=pd.DataFrame([['c',3],['d',4]], columns=['letter','number'])

TypeError: 'dict' object is not callable

In [106]:
df1

  letter  number
0      a       1
1      b       2

In [107]:
df2

  letter  number
0      c       3
1      d       4

In [108]:
pd.concat([df1,df2],ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [109]:
df3=pd.DataFrame([['c',3,'cat'],['d',4,'dog']], columns=['letter','number','animal'])

TypeError: 'dict' object is not callable

In [76]:
pd.concat([df1,df3])

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [77]:
pd.concat([df1,df3],ignore_index=True)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
2      c       3    cat
3      d       4    dog

In [80]:
pd.concat([df1,df3],join='inner',ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [86]:
df4=pd.DataFrame=({'key':['k0','k1','k2','k3','k4','k5'],
                 'a':['a0','a1','a2','a3','a4','a5']})
df4

{'key': ['k0', 'k1', 'k2', 'k3', 'k4', 'k5'],
 'a': ['a0', 'a1', 'a2', 'a3', 'a4', 'a5']}

In [83]:
df

{'key': ['k0', 'k1', 'k2', 'k3', 'k4', 'k5'],
 'a': ['a0', 'a1', 'a2', 'a3', 'a4', 'a5']}

In [97]:
othear=pd.DataFrame({'key': ['k0','k1','k2'],'B': ["b0","b1","b2"]})
othear

TypeError: 'dict' object is not callable

In [101]:
othear=pd.DataFrame({'key': ['k0','k1','k2'],'B': ["b0","b1","b2"]})
othear

TypeError: 'dict' object is not callable

In [110]:
DIX={'name':'yash','age':12}

In [111]:
DIX

{'name': 'yash', 'age': 12}

In [112]:
df=pd.DataFrame({'name':["ahmed","musafir"],'mask':['red','purple'],'weapon':['soldier','knife']})

TypeError: 'dict' object is not callable